GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
static void SCSI_ProcessStart(void);
static void SCSI_ProcessStop(void);
static void SCSI_ProcessReset(void);
static void SCSI_ProcessCommand(void);
static void SCSI_ProcessRead(void);
static void SCSI_ProcessWrite(void);

/***********************************************************************************************************************/

#define MSC_BOT_STATE_NONE                     0       /* None */
#define MSC_BOT_STATE_IDLE                     1       /* Idle */
#define MSC_BOT_STATE_RECOVERY_RESET           2       /* Waiting for reset */
#define MSC_BOT_STATE_RECOVERY_HALT            3       /* Waiting for clear feature halt on data in or out*/
#define MSC_BOT_STATE_HALT_DATA_IN             4       /* Waiting for clear feature halt on data in */
#define MSC_BOT_STATE_HALT_DATA_OUT            5       /* Waiting for clear feature halt on data out */
#define MSC_BOT_STATE_DATA_IN                  6       /* Data In state */
#define MSC_BOT_STATE_DATA_IN_LAST             7       /* Last Data In Last (passed) */
#define MSC_BOT_STATE_DATA_IN_LAST_STALL       8       /* Last Data In Last (failed or phase error) */
#define MSC_BOT_STATE_DATA_OUT                 9       /* Data Out state */

#define MSC_BOT_ABORT_DATA_IN_CSW_CMD_PASSED   4
#define MSC_BOT_ABORT_DATA_IN_CSW_CMD_FAILED   5
#define MSC_BOT_ABORT_DATA_IN_CSW_PHASE_ERROR  6
#define MSC_BOT_ABORT_DATA_OUT_CSW_CMD_PASSED  7
#define MSC_BOT_ABORT_DATA_OUT_CSW_CMD_FAILED  8
#define MSC_BOT_ABORT_DATA_OUT_CSW_PHASE_ERROR 9
   
#define MSC_BOT_CBW_SIGNATURE                  0x43425355
#define MSC_BOT_CSW_SIGNATURE                  0x53425355
#define MSC_BOT_CBW_LENGTH                     31
#define MSC_BOT_CSW_LENGTH                     13

#define MSC_BOT_CSW_CMD_PASSED                 0
#define MSC_BOT_CSW_CMD_FAILED                 1
#define MSC_BOT_CSW_PHASE_ERROR                2

#define MSC_BOT_GET_MAX_LUN                    0xfe
#define MSC_BOT_RESET                          0xff

#define MSC_BOT_EVENT_CONFIGURE                0x00000001
#define MSC_BOT_EVENT_START                    0x00000002
#define MSC_BOT_EVENT_STOP                     0x00000004
#define MSC_BOT_EVENT_RESET                    0x00000008
#define MSC_BOT_EVENT_CLEAR_HALT_DATA_IN       0x00000010
#define MSC_BOT_EVENT_CLEAR_HALT_DATA_OUT      0x00000020
#define MSC_BOT_EVENT_TRANSMIT_0               0x00000040
#define MSC_BOT_EVENT_TRANSMIT_1               0x00000080
#define MSC_BOT_EVENT_RECEIVE_0                0x00000100
#define MSC_BOT_EVENT_RECEIVE_1                0x00000200
#define MSC_BOT_EVENT_RESPONSE                 0x00000400
#define MSC_BOT_EVENT_CSW                      0x00000800
#define MSC_BOT_EVENT_CBW                      0x00001000

#define MSC_BOT_BUFFER_QUEUE_COUNT             2

static void MSC_BOT_Event(uint32_t events);
static void MSC_BOT_Routine(void *context, uint32_t argument);

static void MSC_BOT_Start(void);
static void MSC_BOT_Stop(void);
static void MSC_BOT_Reset(void);
static void MSC_BOT_Abort(uint8_t abort);
static void MSC_BOT_Stall(uint8_t ep_addr);
static void MSC_BOT_ClearHaltDataIn(void);
static void MSC_BOT_ClearHaltDataOut(void);
static void MSC_BOT_SendCSW(uint8_t status);
static void MSC_BOT_Response(const uint8_t *data, uint32_t length);

static void MSC_BOT_SetupTransmit(uint32_t length, uint8_t status);
static void MSC_BOT_ContinueTransmit(uint32_t length, uint8_t status);

static void MSC_BOT_SetupReceive(uint32_t length);
static void MSC_BOT_ContinueReceive(uint32_t length);
static void MSC_BOT_FinishReceive(uint8_t status);

/***********************************************************************************************************************/
/***********************************************************************************************************************/
   
typedef struct
{
    uint32_t dSignature;
    uint32_t dTag;
    uint32_t dDataLength;
    uint8_t  bmFlags;
    uint8_t  bLUN;
    uint8_t  bCBLength;
    uint8_t  CB[16];
} USBD_MSC_BOT_CBWTypeDef;

typedef struct
{
    uint32_t dSignature;
    uint32_t dTag;
    uint32_t dDataResidue;
    uint8_t  bStatus;
} USBD_MSC_BOT_CSWTypeDef;

#define STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE          0xffffffff
#define STM32WB_USBD_MSC_SCSI_BLK_FAULT_COMMUNICATION 0xfffffffe

typedef struct _stm32wb_usbd_msc_control_t {
    const dosfs_storage_interface_t *storage;
    uint8_t                  interface;  
    uint8_t                  max_lun;  

    uint8_t                  bot_state;
    USBD_MSC_BOT_CBWTypeDef  bot_cbw;
    USBD_MSC_BOT_CSWTypeDef  bot_csw;

    volatile uint8_t         bot_index;
    volatile uint8_t         bot_count;
    volatile uint8_t         bot_tx_busy;
    volatile uint8_t         bot_rx_busy;
    volatile uint32_t        bot_tx_length;
    volatile uint32_t        bot_rx_length;
  
    uint8_t                  scsi_medium_removal;
    uint8_t                  scsi_sense_skey;
    uint16_t                 scsi_sense_asc;
    uint32_t                 scsi_sense_address;
    uint32_t                 scsi_blk_count;
    uint32_t                 scsi_blk_size;
    uint32_t                 scsi_blk_address;
    uint32_t                 scsi_blk_length;
    uint32_t                 scsi_blk_total;
    uint32_t                 scsi_blk_fault;
    uint8_t                  scsi_blk_fua;
    uint8_t                  scsi_blk_busy;
    uint8_t                  scsi_blk_index;
    uint8_t                  *scsi_data[2];
    const uint8_t            *scsi_inquiry_data;
} stm32wb_usbd_msc_control_t;

static stm32wb_usbd_msc_control_t stm32wb_usbd_msc_control;

static k_task_t stm32wb_usbd_msc_task;

static __attribute__((aligned(8))) uint8_t stm32wb_usbd_msc_stack[1024];

/***********************************************************************************************************************/

static void stm32wb_usbd_msc_transmit_data(void *context, uint8_t ep_addr);
static void stm32wb_usbd_msc_transmit_response(void *context, uint8_t ep_addr);
static void stm32wb_usbd_msc_transmit_csw(void *context, uint8_t ep_addr);

static void stm32wb_usbd_msc_receive_data(void *context, uint8_t ep_addr, uint16_t count);
static void stm32wb_usbd_msc_receive_cbw(void *context, uint8_t ep_addr, uint16_t count);

/***********************************************************************************************************************/

