GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
/*
 * This code is more complex than expected. USB/MSC uses really only one logical connection
 * over 2 pipe. First the host sends a CBW (Command Block Wrapper), then optionally data is
 * exchanged, then finally the device sends a CSW (Command Status Wrapper) back. If there
 * a mismatch between what the host or devices expects one has to properly resync. If the
 * the CBW is invalid, the device stalls both IN and OUT pipe. If the host expects to
 * receive data, the IN pipe gets stalled, and if the host expects to send data the OUT
 * pipe gets stalled. If both pipes are stalled, the host issues a reset sequence
 * (reset token, then clear halt on IN, then clear halt on OUT). Otherwise the halt on
 * IN or OUT are cleared as needed. When that is done, the devices sends the CSV.
 *
 * The spec lays this out in terms of Hi (host receives), Ho (host wants to send) and
 * Hn (host neither wants to receiver or send). Same for the device, Di, Do, Dn.
 *
 * Hi, Ho & Hn are coded in the CBW:
 *
 * if (dCBWDataTransferLength == 0) {
 *     Hn;
 * } else {
 *     if (bmCBWFlags & 0x80) {
 *         Hi(dCBWDataTransferLength);
 *     } else {
 *         Ho(dCBWDataTransferLength);
 *     }
 * }
 *
 * For the device side it dependends up the command:
 *
 * TEST_UNIT_READY                   Dn
 * START_STOP_UNIT                   Dn
 * PREVENT_ALLOW_MEDIUM_REMOVAL      Dn
 * REQUEST_SENSE                     Do (Dn if "Allocation Length" is 0)
 * INQUIRY                           Do (Dn if "Allocation Length" is 0)
 * MODE_SENSE_6                      Do
 * READ_CAPACITY_10                  Do
 * READ_10                           Do (Dn if "Transfer Length" is 0)
 * WRITE_10                          Di (Dn if "Transfer Length" is 0)
 * <illegal command>                 Dn
 *
 * In general up to dCBWDataTransferLength get transferred; if there is less data, less gets
 * transfered, and dCSWDataResidue contains the delta.
 *
 * The spec identifies 13 cases:
 *
 *                  CSW               STALL     HOST            BOT STATE
 *  (1) Hn = Dn     PASSED / FAILED   -         -               IDLE
 *  (2) Hn < Di     PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (3) Hn < Do     PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (4) Hi > Dn     PASSED / FAILED   DATA_IN   -               HALT_DATA_IN
 *  (5) Hi > Di     PASSED / FAILED   DATA_IN   -               HALT_DATA_IN
 *  (6) Hi = Di     PASSED / FAILED   -         -               IDLE
 *  (7) Hi < Di     PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (8) Hi <> Do    PHASE_ERROR       DATA_IN   RESET_RECOVERY  RECOVERY_RESET
 *  (9) Ho > Dn     PASSED / FAILED   DATA_OUT  -               HALT_DATA_OUT
 * (10) Ho <> Di    PHASE_ERROR       DATA_OUT  RESET_RECOVERY  RECOVERY_RESET
 * (11) Ho > Do     PASSED / FAILED   DATA_OUT  -               HALT_DATA_OUT
 * (12) Ho = Do     PASSED / FAILED   -         -               IDLE
 * (13) Ho < Do     PHASE_ERROR       DATA_OUT  RESET_RECOVERY  RECOVERY_RESET
 *
 * The spec does not say what CSW to send on a invalid CBW. Bot stalled are DATA_IN/DATA_OUT
 * followed by a RESET_RECOVERY.
 */

static void SCSI_SenseCode(uint8_t SKey, uint16_t ASC, uint32_t blk_address)
{
    stm32wb_usbd_msc_control.scsi_sense_skey = SKey;
    stm32wb_usbd_msc_control.scsi_sense_asc = ASC;
    stm32wb_usbd_msc_control.scsi_sense_address = blk_address;
}

static int SCSI_CommandPassed(void)
{
    if (stm32wb_usbd_msc_control.bot_cbw.dDataLength != 0)
    {
        if (stm32wb_usbd_msc_control.bot_cbw.bmFlags & 0x80)
        {
            /* case (4) Hi > Dn */
            return SCSI_STATUS_DATA_IN_CSW_CMD_PASSED;
        }
        else
        {
            /* case (9) Ho > Dn */
            return SCSI_STATUS_DATA_OUT_CSW_CMD_PASSED;
        }
    }  
    else
    {
        /* case (1) Hn = Dn */
        return SCSI_STATUS_CSW_CMD_PASSED;
    }
}

static int SCSI_CommandFailed(uint8_t SKey, uint16_t ASC, uint32_t blk_address)
{
    SCSI_SenseCode(SKey, ASC, blk_address);

    if (stm32wb_usbd_msc_control.bot_cbw.dDataLength == 0)
    {
        /* case (1) Hn = Dn */
        return SCSI_STATUS_CSW_CMD_FAILED;
    }
    else
    {
        if (stm32wb_usbd_msc_control.bot_cbw.bmFlags & 0x80)
        {
            /* case (4) Hi > Dn */
            return SCSI_STATUS_DATA_IN_CSW_CMD_FAILED;
        }
        else
        {
            /* case (9) Ho > Dn */
            return SCSI_STATUS_DATA_OUT_CSW_CMD_FAILED;
        }
    }
}

static bool SCSI_CheckLength(uint32_t length, int *p_status)
{
    if (stm32wb_usbd_msc_control.bot_cbw.dDataLength == 0)
    {
        /* case (1) Hn = Dn */
        *p_status = SCSI_STATUS_CSW_CMD_PASSED;

        return false;
    }
    else
    {
        if (!(stm32wb_usbd_msc_control.bot_cbw.bmFlags & 0x80))
        {
            /* case (10) Ho <> Di */
            *p_status = SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR;
                
            return false;
        }
    }

    return true;
}

static bool SCSI_CheckAllocation(uint32_t allocation, uint32_t length, int *p_status)
{
    if (allocation)
    {
        if (stm32wb_usbd_msc_control.bot_cbw.dDataLength == 0)
        {
            /* case (2) Hn < Di */
            *p_status = SCSI_STATUS_DATA_IN_CSW_PHASE_ERROR;

            return false;
        }
        else
        {
            if (stm32wb_usbd_msc_control.bot_cbw.bmFlags & 0x80)
            {
                if (stm32wb_usbd_msc_control.bot_cbw.dDataLength != allocation)
                {
                    *p_status = SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);

                    return false;
                }
            }
            else
            {
                /* case (10) Ho <> Di */
                *p_status = SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR;
                
                return false;
            }
        }
    }
    else
    {
        if (stm32wb_usbd_msc_control.bot_cbw.dDataLength == 0)
        {
            /* case (1) Hn = Dn */
            *p_status =SCSI_STATUS_CSW_CMD_PASSED;
        }
        else
        {
            if (stm32wb_usbd_msc_control.bot_cbw.bmFlags & 0x80)
            {
                /* case (4) Hi > Dn */
                *p_status = SCSI_STATUS_DATA_IN_CSW_CMD_PASSED;
            }
            else
            {
                /* case (9) Ho > Dn */
                *p_status = SCSI_STATUS_DATA_OUT_CSW_CMD_PASSED;
            }
        }

