GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
        return false;
    }

    return true;
}

static int SCSI_TestUnitReady(const uint8_t *params)
{
    // armv7m_rtt_printf("SCSI_TestUnitReady()\n");
    
    if (!stm32wb_usbd_msc_control.storage->IsReady())
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    return SCSI_CommandPassed();
}

static int SCSI_StartStopUnit(const uint8_t *params)
{
    bool start, loej, noflush;

    start = !!(params[4] & 0x01);
    loej = !!(params[4] & 0x02);
    noflush = !!(params[4] & 0x04);

    // armv7m_rtt_printf("SCSI_StartStopUnit(start=%d, loej=%d, noflush=%d)\n", start, loej, noflush);

    if (!start && loej && !stm32wb_usbd_msc_control.scsi_medium_removal)
    {
        return SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_MEDIA_REMOVAL_PREVENTED, 0);
    }
    
    stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE;

    if (!stm32wb_usbd_msc_control.storage->StartStopUnit(start, loej, noflush, &stm32wb_usbd_msc_control.scsi_blk_fault))
    {
        if (stm32wb_usbd_msc_control.scsi_blk_fault != STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
        {
            return SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_WRITE_FAULT, stm32wb_usbd_msc_control.scsi_blk_fault);
        }
        else
        {
            return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        }
    }
    
    return SCSI_CommandPassed();
}

static int SCSI_PreventAllowMediumRemoval(const uint8_t *params)
{
    bool prevent;

    prevent = !!(params[4] & 0x01);
  
    // armv7m_rtt_printf("SCSI_PreventAllowMediumRemoval(prevent=%d)\n", prevent);

    stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE;

    if (!stm32wb_usbd_msc_control.storage->PreventAllowMediumRemoval(prevent, &stm32wb_usbd_msc_control.scsi_blk_fault))
    {
        if (stm32wb_usbd_msc_control.scsi_blk_fault != STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
        {
            return SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_WRITE_FAULT, stm32wb_usbd_msc_control.scsi_blk_fault);
        }
        else
        {
            return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        }
    } 

    stm32wb_usbd_msc_control.scsi_medium_removal = !prevent;
    
    return SCSI_CommandPassed();
}

static int SCSI_Inquiry(const uint8_t *params)
{
    const uint8_t *data;
    uint32_t length, allocation;
    int status;

    // armv7m_rtt_printf("SCSI_Inquiry()\n");
    
    allocation = params[4];

    if ((params[1] & 0x01) || (params[2] != 0x00))
    {
        return SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);
    }

    data = (const uint8_t *)stm32wb_usbd_msc_control.scsi_inquiry_data;

    length = data[4] + 5;

    if (!SCSI_CheckAllocation(allocation, length, &status))
    {
        return status;
    }

    if (length > allocation)
    {
	length = allocation;
    }
    
    MSC_BOT_Response(data, length);
    
    return SCSI_STATUS_DATA;
}

static int SCSI_RequestSense(const uint8_t *params)
{
    uint8_t *data;
    uint32_t length, allocation;
    int status;

    // armv7m_rtt_printf("SCSI_RequestSense() -> SKEY=%02x, ASC=%04x, ADDRESS=%08x\n", stm32wb_usbd_msc_control.scsi_sense_skey, stm32wb_usbd_msc_control.scsi_sense_asc, stm32wb_usbd_msc_control.scsi_sense_address);
    
    allocation = params[4];

    data = stm32wb_usbd_msc_control.scsi_data[0];

    data[0]  = 0x70;
    data[1]  = 0x00;
    data[2]  = stm32wb_usbd_msc_control.scsi_sense_skey;
    data[3]  = 0x00;
    data[4]  = 0x00;
    data[5]  = 0x00;
    data[6]  = 0x00;
    data[7]  = 0x0a;
    data[8]  = 0x00;
    data[9]  = 0x00;
    data[10] = 0x00;
    data[11] = 0x00;
    data[12] = (uint8_t)(stm32wb_usbd_msc_control.scsi_sense_asc >> 8);
    data[13] = (uint8_t)(stm32wb_usbd_msc_control.scsi_sense_asc >> 0);
    data[14] = 0x00;
    data[15] = 0x00;
    data[16] = 0x00;
    data[17] = 0x00;

    if ((stm32wb_usbd_msc_control.scsi_sense_asc == SCSI_ASC_UNRECOVERED_READ_ERROR) || (stm32wb_usbd_msc_control.scsi_sense_asc == SCSI_ASC_WRITE_FAULT))
    {
        data[0] |= 0x80;

        data[3]  = (uint8_t)(stm32wb_usbd_msc_control.scsi_sense_address >> 24);
        data[4]  = (uint8_t)(stm32wb_usbd_msc_control.scsi_sense_address >> 16);
        data[5]  = (uint8_t)(stm32wb_usbd_msc_control.scsi_sense_address >>  8);
        data[6]  = (uint8_t)(stm32wb_usbd_msc_control.scsi_sense_address >>  0);
    }
    
    stm32wb_usbd_msc_control.scsi_sense_skey = SCSI_SKEY_NO_SENSE;
    stm32wb_usbd_msc_control.scsi_sense_asc = SCSI_ASC_NO_SENSE;
    stm32wb_usbd_msc_control.scsi_sense_address = 0;

    length = SCSI_DATA_LENGTH_REQUEST_SENSE;
    
    if (!SCSI_CheckAllocation(allocation, length, &status))
    {
        return status;
    }

    if (length > allocation)
    {
	length = allocation;
    }

    MSC_BOT_Response(data, length);
    
    return SCSI_STATUS_DATA;
}

static int SCSI_ModeSense6(const uint8_t *params)
{
    uint8_t *data;
    uint8_t pc, page_code;
    uint32_t length;
    bool write_protected;
    int status;

    pc = params[2] >> 6;
    page_code = params[2] & 0x3f;

    // armv7m_rtt_printf("SCSI_ModeSense6(pc=%d, page_code=%d)\n", pc, page_code);

    if (pc == 3)
    {
        return SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_SAVING_PARAMETERS_NOT_SUPPORTED, 0);
    }
    
    if (!stm32wb_usbd_msc_control.storage->GetWriteProtected(&write_protected))
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    data = stm32wb_usbd_msc_control.scsi_data[0];
    length = SCSI_DATA_LENGTH_MODE_SENSE_6;
    
    data[0] = 0x03;
    data[1] = 0x00;
    data[2] = write_protected ? 0x90 : 0x10;
    data[3] = 0x00;

    if ((page_code == 0x08) || (page_code == 0x3f))
    {
        data[4+0]  = 0x08;
        data[4+1]  = 0x12;

        if (pc == 1)
        {
            data[4+2]  = 0x00;
            data[4+3]  = 0x00;
            data[4+4]  = 0x00;
            data[4+5]  = 0x00;
            data[4+6]  = 0x00;
            data[4+7]  = 0x00;
            data[4+8]  = 0x00;
            data[4+9]  = 0x00;
            data[4+10] = 0x00;
            data[4+11] = 0x00;
        }
        else
        {
            data[4+2]  = 0x04; // WCE
            data[4+3]  = 0x00;
            data[4+4]  = 0xff;
            data[4+5]  = 0xff;
            data[4+6]  = 0x00;
            data[4+7]  = 0x00;
            data[4+8]  = 0xff;
            data[4+9]  = 0xff;
            data[4+10] = 0xff;
            data[4+11] = 0xff;
        }

