GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
        data[4+12] = 0x00;
        data[4+13] = 0x00;
        data[4+14] = 0x00;
        data[4+15] = 0x00;
        data[4+16] = 0x00;
        data[4+17] = 0x00;
        data[4+18] = 0x00;
        data[4+19] = 0x00;
        
        length += 20;
    }

    if (!SCSI_CheckLength(length, &status))
    {
        return status;
    }

    MSC_BOT_Response(data, length);
        
    return SCSI_STATUS_DATA;
}

static int SCSI_ReadCapacity10(const uint8_t *params)
{
    uint8_t *data;
    int status;

    // armv7m_rtt_printf("SCSI_ReadCapacity10()\n");

    if (!stm32wb_usbd_msc_control.storage->GetCapacity(&stm32wb_usbd_msc_control.scsi_blk_count, &stm32wb_usbd_msc_control.scsi_blk_size))
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    data = stm32wb_usbd_msc_control.scsi_data[0];
    
    data[0] = (uint8_t)((stm32wb_usbd_msc_control.scsi_blk_count -1) >> 24);
    data[1] = (uint8_t)((stm32wb_usbd_msc_control.scsi_blk_count -1) >> 16);
    data[2] = (uint8_t)((stm32wb_usbd_msc_control.scsi_blk_count -1) >>  8);
    data[3] = (uint8_t)((stm32wb_usbd_msc_control.scsi_blk_count -1) >>  0);
    data[4] = (uint8_t)(stm32wb_usbd_msc_control.scsi_blk_size >> 24);
    data[5] = (uint8_t)(stm32wb_usbd_msc_control.scsi_blk_size >> 16);
    data[6] = (uint8_t)(stm32wb_usbd_msc_control.scsi_blk_size >>  8);
    data[7] = (uint8_t)(stm32wb_usbd_msc_control.scsi_blk_size >>  0);

    if (!SCSI_CheckLength(SCSI_DATA_LENGTH_READ_CAPACITY_10, &status))
    {
        return status;
    }

    MSC_BOT_Response(data, SCSI_DATA_LENGTH_READ_CAPACITY_10);
    
    return SCSI_STATUS_DATA;
}

static int SCSI_Read10(const uint8_t *params)
{
    bool changed;

    stm32wb_usbd_msc_control.scsi_blk_address = (params[2] << 24) | (params[3] << 16) | (params[4] << 8) | (params[5] << 0);
    stm32wb_usbd_msc_control.scsi_blk_length = (params[7] << 8) | (params[8] << 0);

    // armv7m_rtt_printf("SCSI_Read10(address=%08x, length=%d)\n", stm32wb_usbd_msc_control.scsi_blk_address, stm32wb_usbd_msc_control.scsi_blk_length);
    
    /* Check in Media is changed */
    if (!stm32wb_usbd_msc_control.storage->GetChanged(&changed))
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (changed)
    {
        return SCSI_CommandFailed(SCSI_SKEY_UNIT_ATTENTION, SCSI_ASC_NOT_READY_TO_READY_TRANSITION_MEDIA_CHANGED, 0);
    } 
    
    if (stm32wb_usbd_msc_control.scsi_blk_count == 0)
    {
        if (!stm32wb_usbd_msc_control.storage->GetCapacity(&stm32wb_usbd_msc_control.scsi_blk_count, &stm32wb_usbd_msc_control.scsi_blk_size))
        {
            return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 
    }
    
    /* Check address range */
    if ((stm32wb_usbd_msc_control.scsi_blk_address + stm32wb_usbd_msc_control.scsi_blk_length) > stm32wb_usbd_msc_control.scsi_blk_count)
    {
        return SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE, 0);
    }

    if (stm32wb_usbd_msc_control.bot_cbw.dDataLength != (stm32wb_usbd_msc_control.scsi_blk_length * stm32wb_usbd_msc_control.scsi_blk_size))
    {
        return SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);
    }

    if (stm32wb_usbd_msc_control.scsi_blk_length == 0)
    {
        return SCSI_CommandPassed();
    }
    else
    {
        if (!(stm32wb_usbd_msc_control.bot_cbw.bmFlags & 0x80))
        {
            /* case (10) Ho <> Di */
            return SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR;
        }

        /* Acquire Media Lock */
        if (!stm32wb_usbd_msc_control.storage->Acquire())
        {
            return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 

        stm32wb_usbd_msc_control.scsi_blk_busy = true;
        stm32wb_usbd_msc_control.scsi_blk_index = 0;
        stm32wb_usbd_msc_control.scsi_blk_total = stm32wb_usbd_msc_control.scsi_blk_length;
        stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE;

        if (!stm32wb_usbd_msc_control.storage->Read(stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.scsi_blk_index],
                                                    stm32wb_usbd_msc_control.scsi_blk_address,
                                                    1,
                                                    stm32wb_usbd_msc_control.scsi_blk_total,
                                                    &stm32wb_usbd_msc_control.scsi_blk_fault))
        {
            if (stm32wb_usbd_msc_control.scsi_blk_fault != STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
            {
                SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_UNRECOVERED_READ_ERROR, stm32wb_usbd_msc_control.scsi_blk_fault);
            }
            else
            {
                SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_LOGICAL_UNIT_COMMUNICATION_FAILURE, 0);

                stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_COMMUNICATION;
            }
	}

        MSC_BOT_SetupTransmit(stm32wb_usbd_msc_control.scsi_blk_length, ((stm32wb_usbd_msc_control.scsi_blk_fault== STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE) ? MSC_BOT_CSW_CMD_PASSED : MSC_BOT_CSW_CMD_FAILED));

        stm32wb_usbd_msc_control.scsi_blk_address += 1;
        stm32wb_usbd_msc_control.scsi_blk_length -= 1;
        stm32wb_usbd_msc_control.scsi_blk_index ^= 1;
        stm32wb_usbd_msc_control.scsi_blk_total = 0;

        if (!stm32wb_usbd_msc_control.scsi_blk_length)
	{
            stm32wb_usbd_msc_control.storage->Release();

	    stm32wb_usbd_msc_control.scsi_blk_busy = false;
	}
	else
	{
            if (stm32wb_usbd_msc_control.scsi_blk_fault == STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
	    {
		if (!stm32wb_usbd_msc_control.storage->Read(stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.scsi_blk_index],
                                                            stm32wb_usbd_msc_control.scsi_blk_address,
                                                            1,
                                                            stm32wb_usbd_msc_control.scsi_blk_total,
                                                            &stm32wb_usbd_msc_control.scsi_blk_fault))
		{
                    if (stm32wb_usbd_msc_control.scsi_blk_fault != STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
                    {
                        SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_UNRECOVERED_READ_ERROR, stm32wb_usbd_msc_control.scsi_blk_fault);
                    }
                    else
                    {
                        SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_LOGICAL_UNIT_COMMUNICATION_FAILURE, 0);
                        
