GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
                        stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_COMMUNICATION;
                    }
		}
	    }
	    
	    MSC_BOT_ContinueTransmit(stm32wb_usbd_msc_control.scsi_blk_length, ((stm32wb_usbd_msc_control.scsi_blk_fault == STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE) ? MSC_BOT_CSW_CMD_PASSED : MSC_BOT_CSW_CMD_FAILED));
	    
	    stm32wb_usbd_msc_control.scsi_blk_address += 1;
	    stm32wb_usbd_msc_control.scsi_blk_length -= 1;
	    stm32wb_usbd_msc_control.scsi_blk_index ^= 1;
            stm32wb_usbd_msc_control.scsi_blk_total = 0;

	    if (!stm32wb_usbd_msc_control.scsi_blk_length)
	    {
                stm32wb_usbd_msc_control.storage->Release();

                stm32wb_usbd_msc_control.scsi_blk_busy = false;
	    }
	}

        return SCSI_STATUS_DATA;
    }
}

static int SCSI_Write10(const uint8_t *params)
{
    bool write_protected, changed;

    stm32wb_usbd_msc_control.scsi_blk_address = (params[2] << 24) | (params[3] << 16) | (params[4] << 8) | (params[5] << 0);
    stm32wb_usbd_msc_control.scsi_blk_length = (params[7] << 8) | (params[8] << 0);
    stm32wb_usbd_msc_control.scsi_blk_fua = !!(params[1] & 0x08);

    // armv7m_rtt_printf("SCSI_Write10(address=%08x, length=%d, fua=%d)\n", stm32wb_usbd_msc_control.scsi_blk_address, stm32wb_usbd_msc_control.scsi_blk_length, stm32wb_usbd_msc_control.scsi_blk_fua);
    
    /* Check in Media is changed */
    if (!stm32wb_usbd_msc_control.storage->GetChanged(&changed))
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (changed)
    {
        return SCSI_CommandFailed(SCSI_SKEY_UNIT_ATTENTION, SCSI_ASC_NOT_READY_TO_READY_TRANSITION_MEDIA_CHANGED, 0);
    } 
    
    /* Check If media is write-protected */
    if (!stm32wb_usbd_msc_control.storage->GetWriteProtected(&write_protected))
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (write_protected)
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_WRITE_PROTECTED_MEDIA, 0);
    } 

    if (stm32wb_usbd_msc_control.scsi_blk_count == 0)
    {
        if (!stm32wb_usbd_msc_control.storage->GetCapacity(&stm32wb_usbd_msc_control.scsi_blk_count, &stm32wb_usbd_msc_control.scsi_blk_size))
        {
            return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 
    }
    
    /* Check address range */
    if ((stm32wb_usbd_msc_control.scsi_blk_address + stm32wb_usbd_msc_control.scsi_blk_length) > stm32wb_usbd_msc_control.scsi_blk_count)
    {
        return SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE, 0);
    }

    if (stm32wb_usbd_msc_control.bot_cbw.dDataLength != (stm32wb_usbd_msc_control.scsi_blk_length * stm32wb_usbd_msc_control.scsi_blk_size))
    {
        return SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_FIELD_IN_COMMAND_PACKET, 0);
    }

    if (stm32wb_usbd_msc_control.scsi_blk_length == 0)
    {
        return SCSI_CommandPassed();
    }
    else
    {
        if (stm32wb_usbd_msc_control.bot_cbw.bmFlags & 0x80)
        {
            /* case (8) Hi <> Do */
            return SCSI_STATUS_DATA_IN_CSW_PHASE_ERROR;
        }

        /* Acquire Media Lock */
        if (!stm32wb_usbd_msc_control.storage->Acquire())
        {
            return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        } 

        stm32wb_usbd_msc_control.scsi_blk_busy = true;
        stm32wb_usbd_msc_control.scsi_blk_index = 0;
        stm32wb_usbd_msc_control.scsi_blk_total = stm32wb_usbd_msc_control.scsi_blk_length;
        stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE;
	
        MSC_BOT_SetupReceive(stm32wb_usbd_msc_control.scsi_blk_length);

        return SCSI_STATUS_DATA;
    }
}

static int SCSI_SynchronizeCache10(const uint8_t *params)
{
    bool changed;

    // armv7m_rtt_printf("SCSI_SynchronizeCache10()\n");
    
    /* Check in Media is changed */
    if (!stm32wb_usbd_msc_control.storage->GetChanged(&changed))
    {
        return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
    } 

    if (changed)
    {
        return SCSI_CommandFailed(SCSI_SKEY_UNIT_ATTENTION, SCSI_ASC_NOT_READY_TO_READY_TRANSITION_MEDIA_CHANGED, 0);
    } 

    stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE;

    if (!stm32wb_usbd_msc_control.storage->SynchronizeCache(&stm32wb_usbd_msc_control.scsi_blk_fault))
    {
        if (stm32wb_usbd_msc_control.scsi_blk_fault != STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
        {
            return SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_WRITE_FAULT, stm32wb_usbd_msc_control.scsi_blk_fault);
        }
        else
        {
            return SCSI_CommandFailed(SCSI_SKEY_NOT_READY, SCSI_ASC_MEDIUM_NOT_PRESENT, 0);
        }
    }
    
    return SCSI_CommandPassed();
}

static void SCSI_ProcessStart(void)
{
    uint8_t *cache_data;
    const uint8_t *inquiry_data;

    stm32wb_usbd_msc_control.storage->Init(&cache_data, &inquiry_data);

    stm32wb_usbd_msc_control.scsi_medium_removal = true;
    
    stm32wb_usbd_msc_control.scsi_sense_skey = SCSI_SKEY_NO_SENSE;
    stm32wb_usbd_msc_control.scsi_sense_asc = SCSI_ASC_NO_SENSE;
    stm32wb_usbd_msc_control.scsi_sense_address = 0;
    
    stm32wb_usbd_msc_control.scsi_blk_size = 0;
    stm32wb_usbd_msc_control.scsi_blk_count = 0;
    stm32wb_usbd_msc_control.scsi_blk_address = 0;
    stm32wb_usbd_msc_control.scsi_blk_length = 0;
    stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE;
    stm32wb_usbd_msc_control.scsi_blk_fua = false;
    stm32wb_usbd_msc_control.scsi_blk_busy = false;
    stm32wb_usbd_msc_control.scsi_blk_index = 0;
    stm32wb_usbd_msc_control.scsi_data[0] = cache_data;
    stm32wb_usbd_msc_control.scsi_data[1] = cache_data + STM32WB_USBD_MSC_DATA_BLOCK_SIZE;

    stm32wb_usbd_msc_control.scsi_inquiry_data = inquiry_data;
}

static void SCSI_ProcessStop(void)
{
    stm32wb_usbd_msc_control.storage->StartStopUnit(true, false, true, NULL);
    
    stm32wb_usbd_msc_control.storage->DeInit();
}

static void SCSI_ProcessReset(void)
{
    stm32wb_usbd_msc_control.storage->Release();

    stm32wb_usbd_msc_control.scsi_blk_busy = false;
}

static void SCSI_ProcessCommand(void)
{
    const uint8_t *params = (const uint8_t*)&stm32wb_usbd_msc_control.bot_cbw.CB[0];
    int status;
    
