GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
    switch (params[0]) {
    case SCSI_OPCODE_TEST_UNIT_READY:
        status = SCSI_TestUnitReady(params);
        break;
        
    case SCSI_OPCODE_START_STOP_UNIT:
        status = SCSI_StartStopUnit(params);
        break;
    
    case SCSI_OPCODE_PREVENT_ALLOW_MEDIUM_REMOVAL:
        status = SCSI_PreventAllowMediumRemoval(params);
        break;
    
    case SCSI_OPCODE_INQUIRY:
        status = SCSI_Inquiry(params);
        break;
    
    case SCSI_OPCODE_REQUEST_SENSE:
        status = SCSI_RequestSense(params);
        break;

    case SCSI_OPCODE_MODE_SENSE_6:
        status = SCSI_ModeSense6(params);
        break;
        
    case SCSI_OPCODE_READ_CAPACITY_10:
        status = SCSI_ReadCapacity10(params);
        break;
    
    case SCSI_OPCODE_READ_10:
        status = SCSI_Read10(params); 
        break;
    
    case SCSI_OPCODE_WRITE_10:
        status = SCSI_Write10(params);
        break;

    case SCSI_OPCODE_SYNCHRONIZE_CACHE_10:
        status = SCSI_SynchronizeCache10(params);
        break;
        
    default:
        // armv7m_rtt_printf("SCSI_OPCODE = %02x\n", params[0]);

        status = SCSI_CommandFailed(SCSI_SKEY_ILLEGAL_REQUEST, SCSI_ASC_INVALID_COMMAND_OPERATION_CODE, 0);
        break;
    }

    switch (status) {
    case SCSI_STATUS_CSW_CMD_PASSED:
    case SCSI_STATUS_CSW_CMD_FAILED:
        MSC_BOT_SendCSW(status);
        break;

    case SCSI_STATUS_DATA:
        break;

    case SCSI_STATUS_DATA_IN_CSW_CMD_PASSED:
    case SCSI_STATUS_DATA_IN_CSW_CMD_FAILED:
    case SCSI_STATUS_DATA_IN_CSW_PHASE_ERROR:
    case SCSI_STATUS_DATA_OUT_CSW_CMD_PASSED:
    case SCSI_STATUS_DATA_OUT_CSW_CMD_FAILED:
    case SCSI_STATUS_DATA_OUT_CSW_PHASE_ERROR:
        MSC_BOT_Abort(status);
        break;

    default:
        break;
    }
}

static void SCSI_ProcessRead(void)
{
    if (stm32wb_usbd_msc_control.scsi_blk_busy)
    {
        if (stm32wb_usbd_msc_control.scsi_blk_fault == STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
        {
            if (!stm32wb_usbd_msc_control.storage->Read(stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.scsi_blk_index],
                                                        stm32wb_usbd_msc_control.scsi_blk_address,
                                                        1,
                                                        stm32wb_usbd_msc_control.scsi_blk_total,
                                                        &stm32wb_usbd_msc_control.scsi_blk_fault))
            {
                if (stm32wb_usbd_msc_control.scsi_blk_fault != STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
                {
                    SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_UNRECOVERED_READ_ERROR, stm32wb_usbd_msc_control.scsi_blk_fault);
                }
                else
                {
                    SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_LOGICAL_UNIT_COMMUNICATION_FAILURE, 0);
                    
                    stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_COMMUNICATION;
                }
            }
        }
        
        MSC_BOT_ContinueTransmit(stm32wb_usbd_msc_control.scsi_blk_length, ((stm32wb_usbd_msc_control.scsi_blk_fault == STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE) ? MSC_BOT_CSW_CMD_PASSED : MSC_BOT_CSW_CMD_FAILED));
        
        stm32wb_usbd_msc_control.scsi_blk_address += 1;
        stm32wb_usbd_msc_control.scsi_blk_length -= 1;
        stm32wb_usbd_msc_control.scsi_blk_index ^= 1;
        stm32wb_usbd_msc_control.scsi_blk_total = 0;
        
        if (!stm32wb_usbd_msc_control.scsi_blk_length)
        {
            stm32wb_usbd_msc_control.storage->Release();

            stm32wb_usbd_msc_control.scsi_blk_busy = false;
        }
    }
}

static void SCSI_ProcessWrite(void)
{
    if (stm32wb_usbd_msc_control.scsi_blk_busy)
    {
        if (stm32wb_usbd_msc_control.scsi_blk_fault == STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
        {
            if (!stm32wb_usbd_msc_control.storage->Write(stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.scsi_blk_index],
                                                         stm32wb_usbd_msc_control.scsi_blk_address,
                                                         1,
                                                         stm32wb_usbd_msc_control.scsi_blk_total,
                                                         stm32wb_usbd_msc_control.scsi_blk_fua,
                                                         &stm32wb_usbd_msc_control.scsi_blk_fault))
            {
                if (stm32wb_usbd_msc_control.scsi_blk_fault != STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE)
                {
                    SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_WRITE_FAULT, stm32wb_usbd_msc_control.scsi_blk_fault);
                }
                else
                {
                    SCSI_CommandFailed(SCSI_SKEY_HARDWARE_ERROR, SCSI_ASC_LOGICAL_UNIT_COMMUNICATION_FAILURE, 0);
                    
                    stm32wb_usbd_msc_control.scsi_blk_fault = STM32WB_USBD_MSC_SCSI_BLK_FAULT_COMMUNICATION;
                }
            }
        }
        
        stm32wb_usbd_msc_control.scsi_blk_address += 1;
        stm32wb_usbd_msc_control.scsi_blk_length -= 1;
        stm32wb_usbd_msc_control.scsi_blk_index ^= 1;
        stm32wb_usbd_msc_control.scsi_blk_total = 0;
        
        if (stm32wb_usbd_msc_control.scsi_blk_length)
        {
            MSC_BOT_ContinueReceive(stm32wb_usbd_msc_control.scsi_blk_length);
        }
        else
        {
            MSC_BOT_FinishReceive((stm32wb_usbd_msc_control.scsi_blk_fault == STM32WB_USBD_MSC_SCSI_BLK_FAULT_NONE) ? MSC_BOT_CSW_CMD_PASSED : MSC_BOT_CSW_CMD_FAILED);

            stm32wb_usbd_msc_control.storage->Release();
            
            stm32wb_usbd_msc_control.scsi_blk_busy = false;
        }
    }
}

/***********************************************************************************************************************/

static void MSC_BOT_Event(uint32_t events)
{
    k_event_send(&stm32wb_usbd_msc_task, events);
}

