GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
static void MSC_BOT_Routine(void *context, uint32_t argument)
{
    uint32_t events;

    while (1)
    {
	k_event_receive(~0, K_EVENT_ANY, K_TIMEOUT_FOREVER, &events);

	if (events & MSC_BOT_EVENT_CONFIGURE)
	{
	}
    
	if (events & MSC_BOT_EVENT_START)
	{
	    MSC_BOT_Start();
    
	    SCSI_ProcessStart();
	}

	if (events & MSC_BOT_EVENT_STOP)
	{
	    events = 0;
	
	    SCSI_ProcessStop();

	    MSC_BOT_Stop();
	}

	if (events & MSC_BOT_EVENT_RESET)
	{
            events &= ~(MSC_BOT_EVENT_CLEAR_HALT_DATA_IN | MSC_BOT_EVENT_CLEAR_HALT_DATA_OUT | MSC_BOT_EVENT_CBW);

	    MSC_BOT_Reset();

	    SCSI_ProcessReset();
	}

	if (events & MSC_BOT_EVENT_CLEAR_HALT_DATA_IN)
	{
	    MSC_BOT_ClearHaltDataIn();
	}

	if (events & MSC_BOT_EVENT_CLEAR_HALT_DATA_OUT)
	{
	    MSC_BOT_ClearHaltDataOut();
	}

	if (events & MSC_BOT_EVENT_TRANSMIT_0)
	{
            SCSI_ProcessRead();
	}

	if (events & MSC_BOT_EVENT_TRANSMIT_1)
	{
            SCSI_ProcessRead();
	}
        
	if (events & MSC_BOT_EVENT_RECEIVE_0)
	{
            SCSI_ProcessWrite();
	}

	if (events & MSC_BOT_EVENT_RECEIVE_1)
	{
            SCSI_ProcessWrite();
	}
        
	if (events & MSC_BOT_EVENT_RESPONSE)
	{
	    if (stm32wb_usbd_msc_control.bot_state == MSC_BOT_STATE_DATA_IN_LAST)
	    {
		MSC_BOT_SendCSW(MSC_BOT_CSW_CMD_PASSED);
	    }
	    else
	    {
		MSC_BOT_Stall(STM32WB_USBD_MSC_DATA_IN_EP_ADDR);

		if (stm32wb_usbd_msc_control.bot_csw.bStatus == MSC_BOT_CSW_PHASE_ERROR)
		{
		    stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_RECOVERY_RESET;
		}
		else
		{
		    stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_HALT_DATA_IN;
		}
	    }
	}

	if (events & MSC_BOT_EVENT_CSW)
	{
            stm32wb_usbd_msc_control.bot_csw.dSignature = ~MSC_BOT_CSW_SIGNATURE;
	}
    
	if (events & MSC_BOT_EVENT_CBW)
	{
	    stm32wb_usbd_msc_control.bot_csw.dSignature = MSC_BOT_CSW_SIGNATURE;
	    stm32wb_usbd_msc_control.bot_csw.dTag = stm32wb_usbd_msc_control.bot_cbw.dTag;
	    stm32wb_usbd_msc_control.bot_csw.dDataResidue = stm32wb_usbd_msc_control.bot_cbw.dDataLength;

            SCSI_ProcessCommand();
	}
    }
}

static void __svc_MSC_BOT_Start(void)
{
    stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_IDLE;
    stm32wb_usbd_msc_control.bot_csw.dSignature = ~MSC_BOT_CSW_SIGNATURE;

    stm32wb_usbd_dcd_ep_enable(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR);
    stm32wb_usbd_dcd_ep_enable(STM32WB_USBD_MSC_DATA_IN_EP_ADDR);
    
    stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_cbw, MSC_BOT_CBW_LENGTH, stm32wb_usbd_msc_receive_cbw, NULL);    
}

static void __svc_MSC_BOT_Stop(void)
{
    stm32wb_usbd_dcd_ep_disable(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR);
    stm32wb_usbd_dcd_ep_disable(STM32WB_USBD_MSC_DATA_IN_EP_ADDR);

    stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_NONE;
}

static void __svc_MSC_BOT_Reset(void)
{
    stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_RECOVERY_HALT;
}

static void __svc_MSC_BOT_Abort(uint8_t abort)
{
    switch (abort) {
    case MSC_BOT_ABORT_DATA_IN_CSW_CMD_PASSED:
    case MSC_BOT_ABORT_DATA_IN_CSW_CMD_FAILED:
    case MSC_BOT_ABORT_DATA_IN_CSW_PHASE_ERROR:
        stm32wb_usbd_dcd_ep_stall(STM32WB_USBD_MSC_DATA_IN_EP_ADDR);

        stm32wb_usbd_msc_control.bot_csw.bStatus = (abort - MSC_BOT_ABORT_DATA_IN_CSW_CMD_PASSED);

        stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_HALT_DATA_IN;
        break;

    case MSC_BOT_ABORT_DATA_OUT_CSW_CMD_PASSED:
    case MSC_BOT_ABORT_DATA_OUT_CSW_CMD_FAILED:
    case MSC_BOT_ABORT_DATA_OUT_CSW_PHASE_ERROR:
        stm32wb_usbd_dcd_ep_stall(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR);

        stm32wb_usbd_msc_control.bot_csw.bStatus = (abort - MSC_BOT_ABORT_DATA_OUT_CSW_CMD_PASSED);

        stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_HALT_DATA_OUT;
        break;

    default:
        break;
    }
}

static void __svc_MSC_BOT_Stall(uint8_t ep_addr)
{      
    stm32wb_usbd_dcd_ep_stall(ep_addr);
}

static void __svc_MSC_BOT_ClearHaltDataIn(void)
{      
    uint8_t bot_state_previous = stm32wb_usbd_msc_control.bot_state;

    if (stm32wb_usbd_msc_control.bot_state == MSC_BOT_STATE_RECOVERY_HALT)
    {
	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_HALT_DATA_OUT;
    }
    
    if (stm32wb_usbd_msc_control.bot_state == MSC_BOT_STATE_HALT_DATA_IN)
    {
	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_IDLE;
    }

    if ((stm32wb_usbd_msc_control.bot_state != bot_state_previous) && (stm32wb_usbd_msc_control.bot_state == MSC_BOT_STATE_IDLE))
    {
        if (stm32wb_usbd_msc_control.bot_csw.dSignature == MSC_BOT_CSW_SIGNATURE)
        {
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
            stm32wb_usbd_dcd_lpm_reference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_MSC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

            stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_csw, MSC_BOT_CSW_LENGTH, stm32wb_usbd_msc_transmit_csw, NULL);
        }
        else
        {
            stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_cbw, MSC_BOT_CBW_LENGTH, stm32wb_usbd_msc_receive_cbw, NULL);    
        }
    }
}

static void __svc_MSC_BOT_ClearHaltDataOut(void)
{      
    uint8_t bot_state_previous = stm32wb_usbd_msc_control.bot_state;

    if (stm32wb_usbd_msc_control.bot_state == MSC_BOT_STATE_RECOVERY_HALT)
    {
	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_HALT_DATA_IN;
    }
    
    if (stm32wb_usbd_msc_control.bot_state == MSC_BOT_STATE_HALT_DATA_OUT)
    {
	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_IDLE;
    }

    if ((stm32wb_usbd_msc_control.bot_state != bot_state_previous) && (stm32wb_usbd_msc_control.bot_state == MSC_BOT_STATE_IDLE))
    {
        if (stm32wb_usbd_msc_control.bot_csw.dSignature == MSC_BOT_CSW_SIGNATURE)
        {
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
            stm32wb_usbd_dcd_lpm_reference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_MSC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

