GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
            stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_csw, MSC_BOT_CSW_LENGTH, stm32wb_usbd_msc_transmit_csw, NULL);
        }
        else
        {
            stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_cbw, MSC_BOT_CBW_LENGTH, stm32wb_usbd_msc_receive_cbw, NULL);    
        }
    }
}

static void __svc_MSC_BOT_SendCSW(uint8_t status)
{
    stm32wb_usbd_msc_control.bot_csw.bStatus = status;
    stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_IDLE;

    stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_csw, MSC_BOT_CSW_LENGTH, stm32wb_usbd_msc_transmit_csw, NULL);
}

static void __svc_MSC_BOT_Response(const uint8_t *data, uint32_t length)
{
    if (stm32wb_usbd_msc_control.bot_csw.dDataResidue > length)
    {
	/* case (5) Hi > Di */
	stm32wb_usbd_msc_control.bot_csw.bStatus = MSC_BOT_CSW_CMD_PASSED;

	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_DATA_IN_LAST_STALL;
	
	stm32wb_usbd_msc_control.bot_csw.dDataResidue -= length;
    }
    else
    {
        if (length > stm32wb_usbd_msc_control.bot_csw.dDataResidue)
        {
            /* case (7) Hi < Di */
            stm32wb_usbd_msc_control.bot_csw.bStatus = MSC_BOT_CSW_PHASE_ERROR;
            
            stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_DATA_IN_LAST_STALL;

            length = stm32wb_usbd_msc_control.bot_csw.dDataResidue;
        }
        else
        {
            /* case (6) Hi == Di */
        }
        
        stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_DATA_IN_LAST;

        stm32wb_usbd_msc_control.bot_csw.dDataResidue = 0;
    }
    
    stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t*)data, length, stm32wb_usbd_msc_transmit_response, NULL);
}

static void __svc_MSC_BOT_SetupTransmit(uint32_t length, uint8_t status)
{
    if (length == 1)
    {
	stm32wb_usbd_msc_control.bot_csw.bStatus = status;

	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_IDLE;
    }
    else
    {
	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_DATA_IN;
    }

    stm32wb_usbd_msc_control.bot_index = 0;
    armv7m_atomic_storeb(&stm32wb_usbd_msc_control.bot_count, 1);

    armv7m_atomic_store(&stm32wb_usbd_msc_control.bot_tx_length, length);

    stm32wb_usbd_msc_control.bot_tx_busy = true;

    stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.bot_index][0], STM32WB_USBD_MSC_DATA_BLOCK_SIZE, stm32wb_usbd_msc_transmit_data, NULL);
}

static void __svc_MSC_BOT_ContinueTransmit(uint32_t length, uint8_t status)
{
    if (length == 1)
    {
	stm32wb_usbd_msc_control.bot_csw.bStatus = status;

	stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_IDLE;
    }
    
    armv7m_atomic_incb(&stm32wb_usbd_msc_control.bot_count);

    if (!stm32wb_usbd_msc_control.bot_tx_busy)
    {
	stm32wb_usbd_msc_control.bot_tx_busy = true;
		
	stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.bot_index][0], STM32WB_USBD_MSC_DATA_BLOCK_SIZE, stm32wb_usbd_msc_transmit_data, NULL);
    }
}

static void __svc_MSC_BOT_SetupReceive(uint32_t length)
{
    stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_DATA_OUT;  

    stm32wb_usbd_msc_control.bot_index = 0;
    armv7m_atomic_storeb(&stm32wb_usbd_msc_control.bot_count, 0);

    armv7m_atomic_store(&stm32wb_usbd_msc_control.bot_rx_length, length);

    stm32wb_usbd_msc_control.bot_rx_busy = true;
    
    stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.bot_index][0], STM32WB_USBD_MSC_DATA_BLOCK_SIZE, stm32wb_usbd_msc_receive_data, NULL);
}

static void __svc_MSC_BOT_ContinueReceive(uint32_t length)
{
    armv7m_atomic_decb(&stm32wb_usbd_msc_control.bot_count);
    
    if (stm32wb_usbd_msc_control.bot_rx_length)
    {
	if (!stm32wb_usbd_msc_control.bot_rx_busy)
	{
	    stm32wb_usbd_msc_control.bot_rx_busy = true;
	    
	    stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.bot_index][0], STM32WB_USBD_MSC_DATA_BLOCK_SIZE, stm32wb_usbd_msc_receive_data, NULL);
	}
    }
}

static void __svc_MSC_BOT_FinishReceive(uint8_t status)
{
    armv7m_atomic_decb(&stm32wb_usbd_msc_control.bot_count);

    __svc_MSC_BOT_SendCSW(status);
}

static void MSC_BOT_Start(void)
{
    armv7m_svcall_0((uint32_t)&__svc_MSC_BOT_Start);
}

static void MSC_BOT_Stop(void)
{
    armv7m_svcall_0((uint32_t)&__svc_MSC_BOT_Stop);
}

static void MSC_BOT_Reset(void)
{
    armv7m_svcall_0((uint32_t)&__svc_MSC_BOT_Reset);
}

static void MSC_BOT_Abort(uint8_t abort)
{
    armv7m_svcall_1((uint32_t)&__svc_MSC_BOT_Abort, (uint32_t)abort);
}

static void MSC_BOT_Stall(uint8_t ep_addr)
{
    armv7m_svcall_1((uint32_t)&__svc_MSC_BOT_Stall, (uint32_t)ep_addr);
}

static void MSC_BOT_ClearHaltDataIn(void)
{
    armv7m_svcall_0((uint32_t)&__svc_MSC_BOT_ClearHaltDataIn);
}

static void MSC_BOT_ClearHaltDataOut(void)
{
    armv7m_svcall_0((uint32_t)&__svc_MSC_BOT_ClearHaltDataOut);
}

static void MSC_BOT_SendCSW(uint8_t status)
{
    armv7m_svcall_1((uint32_t)&__svc_MSC_BOT_SendCSW, (uint32_t)status);
}

static void MSC_BOT_Response(const uint8_t *data, uint32_t length)
{
    armv7m_svcall_2((uint32_t)&__svc_MSC_BOT_Response, (uint32_t)data, (uint32_t)length);
}

static void MSC_BOT_SetupTransmit(uint32_t length, uint8_t status)
{
    armv7m_svcall_2((uint32_t)&__svc_MSC_BOT_SetupTransmit, (uint32_t)length, (uint32_t)status);
}

static void MSC_BOT_ContinueTransmit(uint32_t length, uint8_t status)
{
    armv7m_svcall_2((uint32_t)&__svc_MSC_BOT_ContinueTransmit, (uint32_t)length, (uint32_t)status);
}

static void MSC_BOT_SetupReceive(uint32_t length)
{
    armv7m_svcall_1((uint32_t)&__svc_MSC_BOT_SetupReceive, (uint32_t)length);
}

static void MSC_BOT_ContinueReceive(uint32_t length)
{
    armv7m_svcall_1((uint32_t)&__svc_MSC_BOT_ContinueReceive, (uint32_t)length);
}

static void MSC_BOT_FinishReceive(uint8_t status)
{
    armv7m_svcall_1((uint32_t)&__svc_MSC_BOT_FinishReceive, (uint32_t)status);
}

/***********************************************************************************************************************/

