GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
static void __attribute__((optimize("O3"))) stm32wb_usbd_msc_transmit_data(void *context, uint8_t ep_addr)
{
    MSC_BOT_Event((stm32wb_usbd_msc_control.bot_index & 1) ? MSC_BOT_EVENT_TRANSMIT_1 : MSC_BOT_EVENT_TRANSMIT_0);

    __armv7m_atomic_dec(&stm32wb_usbd_msc_control.bot_tx_length);
    
    stm32wb_usbd_msc_control.bot_csw.dDataResidue -= stm32wb_usbd_msc_control.scsi_blk_size;
    
    stm32wb_usbd_msc_control.bot_index ^= 1;
    
    __armv7m_atomic_decb(&stm32wb_usbd_msc_control.bot_count);

    stm32wb_usbd_msc_control.bot_tx_busy = false;
    
    if (stm32wb_usbd_msc_control.bot_tx_length)
    {
        if (stm32wb_usbd_msc_control.bot_count != 0)
        {
            stm32wb_usbd_msc_control.bot_tx_busy = true;
            
            stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.bot_index][0], STM32WB_USBD_MSC_DATA_BLOCK_SIZE, stm32wb_usbd_msc_transmit_data, NULL);
        }
    }
    else
    {
        stm32wb_usbd_dcd_ep_transmit(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_csw, MSC_BOT_CSW_LENGTH, stm32wb_usbd_msc_transmit_csw, NULL);
    }
}

static void __attribute__((optimize("O3"))) stm32wb_usbd_msc_transmit_response(void *context, uint8_t ep_addr)
{
    MSC_BOT_Event(MSC_BOT_EVENT_RESPONSE);
}

static void __attribute__((optimize("O3"))) stm32wb_usbd_msc_transmit_csw(void *context, uint8_t ep_addr)
{
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
    stm32wb_usbd_dcd_lpm_unreference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_MSC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

    stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.bot_cbw, MSC_BOT_CBW_LENGTH, stm32wb_usbd_msc_receive_cbw, NULL);    
        
    MSC_BOT_Event(MSC_BOT_EVENT_CSW);
}

static void __attribute__((optimize("O3"))) stm32wb_usbd_msc_receive_data(void *context, uint8_t ep_addr, uint16_t count)
{
    MSC_BOT_Event((stm32wb_usbd_msc_control.bot_index & 1) ? MSC_BOT_EVENT_RECEIVE_1 : MSC_BOT_EVENT_RECEIVE_0);
    
    __armv7m_atomic_dec(&stm32wb_usbd_msc_control.bot_rx_length);
    
    stm32wb_usbd_msc_control.bot_csw.dDataResidue -= stm32wb_usbd_msc_control.scsi_blk_size;
    
    stm32wb_usbd_msc_control.bot_index ^= 1;
    
    __armv7m_atomic_incb(&stm32wb_usbd_msc_control.bot_count);
    
    stm32wb_usbd_msc_control.bot_rx_busy = false;

    if (stm32wb_usbd_msc_control.bot_rx_length)
    {
	if (stm32wb_usbd_msc_control.bot_count != 2)
	{
	    stm32wb_usbd_msc_control.bot_rx_busy = true;
	    
	    stm32wb_usbd_dcd_ep_receive(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, (uint8_t *)&stm32wb_usbd_msc_control.scsi_data[stm32wb_usbd_msc_control.bot_index][0], STM32WB_USBD_MSC_DATA_BLOCK_SIZE, stm32wb_usbd_msc_receive_data, NULL);
	}
    }
}

static void __attribute__((optimize("O3"))) stm32wb_usbd_msc_receive_cbw(void *context, uint8_t ep_addr, uint16_t count)
{
#if (STM32WB_USBD_DCD_LPM_SUPPORTED == 1)
    stm32wb_usbd_dcd_lpm_reference(STM32WB_USBD_DCD_EP_MASK(STM32WB_USBD_MSC_DATA_IN_EP_ADDR));
#endif /* STM32WB_USBD_DCD_LPM_SUPPORTED == 1 */

    if ((count != MSC_BOT_CBW_LENGTH) ||
        (stm32wb_usbd_msc_control.bot_cbw.dSignature != MSC_BOT_CBW_SIGNATURE) ||
        (stm32wb_usbd_msc_control.bot_cbw.bLUN > stm32wb_usbd_msc_control.max_lun) || 
        (stm32wb_usbd_msc_control.bot_cbw.bCBLength == 0) || 
        (stm32wb_usbd_msc_control.bot_cbw.bCBLength > 16))
    {
        stm32wb_usbd_dcd_ep_stall(STM32WB_USBD_MSC_DATA_IN_EP_ADDR);
        stm32wb_usbd_dcd_ep_stall(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR);

        stm32wb_usbd_msc_control.bot_state = MSC_BOT_STATE_RECOVERY_RESET;
    }
    else
    {
        MSC_BOT_Event(MSC_BOT_EVENT_CBW);
    }
}

static void stm32wb_usbd_msc_configure(void *context, uint8_t interface)
{
    uint16_t pma_address;

    stm32wb_usbd_msc_control.storage = &dosfs_storage_interface;
    stm32wb_usbd_msc_control.interface = interface;
    
    k_task_create(&stm32wb_usbd_msc_task, "USB/MSC", 15, &stm32wb_usbd_msc_stack[0], sizeof(stm32wb_usbd_msc_stack), 0);
    k_task_start(&stm32wb_usbd_msc_task, MSC_BOT_Routine, NULL, 0);

    stm32wb_usbd_dcd_ep_configure(STM32WB_USBD_MSC_DATA_IN_EP_ADDR, STM32WB_USBD_DCD_EP_TYPE_BULK_DBL, STM32WB_USBD_MSC_DATA_MAX_PACKET_SIZE, 0, &pma_address);
    stm32wb_usbd_dcd_ep_configure(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR, STM32WB_USBD_DCD_EP_TYPE_BULK_DBL, STM32WB_USBD_MSC_DATA_MAX_PACKET_SIZE, pma_address, NULL);
    
    MSC_BOT_Event(MSC_BOT_EVENT_CONFIGURE);
}

static void stm32wb_usbd_msc_start(void *context)
{
    MSC_BOT_Event(MSC_BOT_EVENT_START);
}

static void stm32wb_usbd_msc_stop(void *context)
{
    MSC_BOT_Event(MSC_BOT_EVENT_STOP);
}

static int stm32wb_usbd_msc_request(void *context, int state, const stm32wb_usbd_request_t *request, uint8_t *data, const uint8_t **p_data_return, uint16_t *p_length_return, stm32wb_usbd_status_routine_t *p_status_routine_return)
{
    uint8_t ep_addr;
    int status;

    status = STM32WB_USBD_REQUEST_STATUS_UNHANDLED;
    
    switch (request->bmRequestType & USB_REQ_RECIPIENT_MASK) {
    case USB_REQ_RECIPIENT_INTERFACE: {
        switch (request->bmRequestType & USB_REQ_TYPE_MASK) {
        case USB_REQ_TYPE_CLASS: {
            switch (request->bRequest) {
            case MSC_BOT_GET_MAX_LUN: {
                if ((request->wValue == 0) && (request->wLength == 1))
                {
                    *p_data_return = data;
                    *p_length_return = 1;
                        
                    data[0] = stm32wb_usbd_msc_control.max_lun;
                        
                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                }
                break;
            }
		    
            case MSC_BOT_RESET: {
                if ((request->wValue == 0) && (request->wLength == 0))
                {
                    MSC_BOT_Event(MSC_BOT_EVENT_RESET);

                    status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                }
                break;
            }

            default:
                break;
            }
            break;
        }

        default:
            break;
        }

	break;
    }

