GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_usbd_msc.c
    case USB_REQ_RECIPIENT_ENDPOINT: {
	ep_addr = request->wIndex & 255;
	
        switch (request->bmRequestType & USB_REQ_TYPE_MASK) {
        case USB_REQ_TYPE_STANDARD: {
            switch (request->bRequest) {
            case USB_REQ_CODE_CLEAR_FEATURE: {
                if (request->wValue == USB_FEATURE_ENDPOINT_HALT)
                {
                    if (ep_addr == STM32WB_USBD_MSC_DATA_IN_EP_ADDR)
                    {
                        if ((stm32wb_usbd_msc_control.bot_state != MSC_BOT_STATE_RECOVERY_RESET) && stm32wb_usbd_dcd_ep_is_stalled(STM32WB_USBD_MSC_DATA_IN_EP_ADDR))
                        {
                            stm32wb_usbd_dcd_ep_unstall(STM32WB_USBD_MSC_DATA_IN_EP_ADDR);
                        
                            MSC_BOT_Event(MSC_BOT_EVENT_CLEAR_HALT_DATA_IN);

                            status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                        }
                        else
                        {
                            status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                        }
                    }
                    else
                    {
                        if ((stm32wb_usbd_msc_control.bot_state != MSC_BOT_STATE_RECOVERY_RESET) && stm32wb_usbd_dcd_ep_is_stalled(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR))
                        {
                            stm32wb_usbd_dcd_ep_unstall(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR);
                        
                            MSC_BOT_Event(MSC_BOT_EVENT_CLEAR_HALT_DATA_OUT);

                            status = STM32WB_USBD_REQUEST_STATUS_SUCCESS;
                        }
                        else
                        {
                            status = STM32WB_USBD_REQUEST_STATUS_FAILURE;
                        }
                    }
                }
                break;
            }

            default:
                break;
            }
            break;
        }

        default:
            break;
        }
	break;
    }
	
    default:
	break;
    }

    return status;
}

static void stm32wb_usbd_msc_suspend(void *context)
{
}

static void stm32wb_usbd_msc_resume(void *context)
{
}

const stm32wb_usbd_class_t stm32wb_usbd_msc_class = {
    stm32wb_usbd_msc_configure,
    stm32wb_usbd_msc_start,
    stm32wb_usbd_msc_stop,
    stm32wb_usbd_msc_request,
    stm32wb_usbd_msc_suspend,
    stm32wb_usbd_msc_resume,
    NULL,
    STM32WB_USBD_MSC_INTERFACE_COUNT,
    (STM32WB_USBD_EP_MASK(STM32WB_USBD_MSC_DATA_IN_EP_ADDR) | STM32WB_USBD_EP_MASK(STM32WB_USBD_MSC_DATA_OUT_EP_ADDR)),
};

/************************************************************************************************************************************************************/
